Autodesk.Revit.DB.Structure.SlabFoundationType
SlabFoundation type.

Autodesk.Revit.DB.Structure.SlabFoundationType.SlabOnGrade
SlabFoundationType is SlabOnGrade.

Autodesk.Revit.DB.Structure.SlabFoundationType.SlabFoundation
SlabFoundationType is SlabFoundation.

Autodesk.Revit.DB.Structure.SlabFoundationType.SlabTwoWay
SlabFoundationType is SlabTwoWay.

Autodesk.Revit.DB.Structure.SlabFoundationType.SlabOneWay
SlabFoundationType is SlabOneWay.